app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "message_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "hey ..."], ["message_id", 5], ["created_at", "2015-12-15 10:28:02.710006"], ["updated_at", "2015-12-15 10:28:02.710006"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 3], ["updated_at", "2015-12-15 10:28:02.747062"], ["id", 1]]
---
  def create
     @comment = @message.comments.create(comment_params)
     @comment.user_id = current_user.id

      if @comment.save

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 5]]
---
   def find_message
   	    @message = Message.find(params[:message_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."message_id" = ? AND "comments"."id" = ? LIMIT 1  [["message_id", 3], ["id", 8]]
---
    def find_comment
		@comment = @message.comments.find(params[:id])