app/controllers/messages_controller.rb

    def index
    	@messages = Message.all.order("created_at DESC")
---
SELECT "messages".* FROM "messages"  ORDER BY created_at DESC

    def create
       @message = current_user.messages.build(message_params)
         if @message.save
---
INSERT INTO "messages" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

         def update
         	if @message.update(message_params)
---
UPDATE "messages" SET "description" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["description", "Mmm...fluffy white marshmellows that melt so good... And the taste..\r\n\r\n\r\nGEEEEEZE!"], ["updated_at", "2015-12-15 06:56:37.407071"], ["id", 2]]